In [8]:
import requests
import pandas
import wbgapi as wb
import json
countryList = ['FRA','IND','AUS','TUN', 'USA']

In [9]:
governmentExpenditure = 'SE.XPD.TOTL.GB.ZS'

In [10]:
ren = wb.data.DataFrame(governmentExpenditure, countryList, time=range(2015, 2019))
ren

           YR2015    YR2016    YR2017    YR2018
economy
AUS      14.08579  13.80435  13.60292  13.48046
FRA           NaN       NaN   9.65243   9.72483
IND      12.53117  12.75355       NaN       NaN
TUN      22.66534       NaN       NaN       NaN
USA           NaN       NaN       NaN       NaN

In [ ]:
ren.to_csv(r'/Users/helmichaaba/governmentExpenditure.csv')

In [11]:
schoolTertiaryEnrollment = 'SE.TER.ENRR'

In [12]:
ren = wb.data.DataFrame(schoolTertiaryEnrollment, countryList, time=range(2015, 2019))
ren

             YR2015      YR2016      YR2017      YR2018
economy
AUS      118.610863  120.965714  113.142159  107.808052
FRA       62.785931   64.727676   65.802231   67.543518
IND       26.768990   26.829220   27.442129   28.060551
TUN       35.191139   32.815361   32.149380   31.746519
USA       88.889412   88.835052   88.167389   88.299179

In [ ]:
ren.to_csv(r'/Users/helmichaaba/schoolTertiaryEnrollment.csv')

In [13]:
unemploymentTotal = 'SL.UEM.TOTL.NE.ZS'

In [14]:
ren = wb.data.DataFrame(unemploymentTotal, countryList, time=range(2015, 2019))
ren

         YR2015  YR2016  YR2017  YR2018
economy
AUS        6.05    5.71    5.59    5.30
FRA       10.35   10.05    9.41    9.02
IND         NaN     NaN     NaN    5.33
TUN       15.16   15.56   15.33   15.46
USA        5.28    4.87    4.36    3.90

In [ ]:
ren.to_csv(r'/Users/helmichaaba/unemploymentTotal.csv')